* TODOs                                                                 :BLOG:
** Posts
*** DONE write 2018 review
    CLOSED: [2019-01-02 Wed] SCHEDULED: <2019-01-02 Wed>
*** signature aggregation schemas (Threshold, Ring)
*** DONE open source Actihunt
    CLOSED: [2019-02-14 Thu] SCHEDULED: <2019-02-14 Thu>
*** DONE deribit-api-ruby library
    CLOSED: [2019-05-03 Fri 20:10]
    :LOGBOOK:
    CLOCK: [2019-05-03 Fri 17:10]--[2019-05-03 Fri 20:10] =>  3:00
    :END:
*** DONE bitmex-api-ruby library
    CLOSED: [2019-02-02 Sat] SCHEDULED: <2019-02-02 Sat>
*** bitmex mobile app
*** organize projects with org-mode/agenda
*** Homomorphic commitments: Pedersen vs. ElGamal
*** Schnorr vs. Threshold signature aggregations
*** literate blogging with Orgmode
    - evaluate block inline
    - counting lines
    - pass results between blocks
    - edit block's content in native buffer
    - exporting to multiple formats
*** DONE Week/Day close tradingview indicator
    CLOSED: [2019-02-28 Thu] SCHEDULED: <2019-02-28 Thu>
*** cryptographic trap-doors
*** homomorphic encryption
*** zero-knowledge proofs
*** DONE RSA encryption scheme
    CLOSED: [2019-03-18 Mon] SCHEDULED: <2019-03-15 Fri>
*** personal finance with Ledger
*** DONE ElGamal encryption scheme
    CLOSED: [2019-03-27 Wed 15:18] SCHEDULED: <2019-03-26 Tue>
   :LOGBOOK:
   CLOCK: [2019-03-27 Wed 11:14]--[2019-03-27 Wed 15:17] => 4:03
   :END:
*** NTRU lattice-based encryption scheme
    :PROPERTIES:
    :ID:       750DD774-7C04-45F2-90BF-5FE3FFB4E26E
    :END:
    :LOGBOOK:
    CLOCK: [2019-05-03 Fri 11:49]--[2019-05-03 Fri 15:09] =>  3:20
    CLOCK: [2019-05-02 Thu 10:12]--[2019-05-02 Thu 18:04] =>  7:52
    :END:
*** DONE from Jekyll to Hugo
    CLOSED: [2019-04-19 Fri 14:50]
    :LOGBOOK:
    CLOCK: [2019-04-19 Fri 14:07]--[2019-04-19 Fri 14:50] =>  0:43
    :END:
*** DONE ECDSA signature scheme
    CLOSED: [2019-04-09 Tue 17:12]
    :LOGBOOK:
    CLOCK: [2019-04-09 Tue 11:37]--[2019-04-09 Tue 17:12] =>  5:35
    CLOCK: [2019-04-07 Sun 07:48]--[2019-04-07 Sun 18:45] => 10:57
    :END:
*** DONE slices of Bitcoin indicator
    CLOSED: [2019-05-31 Fri 16:20]
*** DONE Schnorr signatures
    CLOSED: [2019-06-27 Thu 10:56]

** Fixes
*** add Euler's method to RSA
*** add tags to all posts
*** DONE use session for Python src blocks
    CLOSED: [2019-03-26 Tue]
*** use naming conventions: p - prime, m - message, c - cipher, t - trapdoor
*** use latex formulas
*** links with ' sign
*** use org citation, references
*** add subtitles
*** DONE fix URLs points to other posts
    CLOSED: [2019-07-05 Fri 11:27]
** Tasks
*** TODO write new blog
    SCHEDULED: <2019-07-03 Wed +2w>
    :PROPERTIES:
    :LAST_REPEAT: [2019-06-27 Thu 10:56]
    :END:
    - State "DONE"       from "TODO"       [2019-06-27 Thu 10:56]
    - State "DONE"       from "TODO"       [2019-06-26 Wed 18:10]
    - State "DONE"       from "TODO"       [2019-05-31 Fri 16:58]
    - State "DONE"       from "TODO"       [2019-05-03 Fri 20:18]
    - State "DONE"       from "TODO"       [2019-04-19 Fri 15:36]
    - State "DONE"       from "TODO"       [2019-04-09 Tue 17:12]
    - State "DONE"       from "TODO"       [2019-03-27 Wed 15:16]
*** DONE Wakatime reports=B$9
    CLOSED: [2019-03-14 Thu] SCHEDULED: <2019-03-14 Thu>
*** Runkeeper reports
*** DONE add comments
    CLOSED: [2019-05-02 Thu 10:03]
    :LOGBOOK:
    CLOCK: [2019-05-02 Thu 09:30]--[2019-05-02 Thu 10:02] =>  0:32
    :END:
*** DONE migrate blog to Hugo+Gitlab
    CLOSED: [2019-04-19 Fri 13:41]
   :LOGBOOK:
   CLOCK: [2019-04-19 Fri 09:50]--[2019-04-19 Fri 13:41] =>  3:51
   CLOCK: [2019-04-18 Thu 16:07]--[2019-04-18 Thu 17:34] =>  1:27
   :END:
*** DONE add SSL: https://gitlab.com/help/user/project/pages/lets_encrypt_for_gitlab_pages.md
    CLOSED: [2019-04-20 Sat 12:03]
*** use Sage interpreter in Hugo
*** DONE add Google analytics
    CLOSED: [2019-02-28 Thu] SCHEDULED: <2019-02-28 Thu>
*** DONE menu sections
    CLOSED: [2019-07-05 Fri 11:20]
*** TODO Renew Lets Encrypt SSL certificate
    SCHEDULED: <2019-09-13 Fri +10w>
    :PROPERTIES:
    :LAST_REPEAT: [2019-07-05 Fri 13:17]
    :END:
    - State "DONE"       from "TODO"       [2019-07-05 Fri 13:17]
